#### ElectricalAnalyticalNodeType Enumeration

---

|  |
| --- |
| See Also |

The type of electrical analytical node.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public enum ElectricalAnalyticalNodeType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ElectricalAnalyticalNodeType ``` |

| Visual C++ |
| --- |
| ``` public enum class ElectricalAnalyticalNodeType ``` |

# Members

| Member name | Description |
| --- | --- |
| PowerSource | Power Source |
| Bus | Bus |
| Transformer | Transformer |
| TransferSwitch | Transfer Switch |
| EquipmentLoad | Equipment Load |

# See Also

Autodesk.Revit.DB.Electrical Namespace